app/controllers/opportunities_controller.rb

  def show

    render json: @organization.opportunities.find(params[:id])
---
SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."organization_id" = $1 AND "opportunities"."id" = $2 LIMIT $3  [["organization_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    # @opportunity = @organization.opportunity.build()
    @opportunity = Opportunity.new(opportunity_params)
    @opportunity.organization = @organization
    @opportunity.user = User.find(opportunity_params[:user_id])
    if @opportunity.save
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "opportunities" ("created_at", "updated_at", "organization_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2021-01-31 22:38:44.337181"], ["updated_at", "2021-01-31 22:38:44.337181"], ["organization_id", 1], ["user_id", 1]]

  def update
    if @opportunity.update(opportunity_params)
---
UPDATE "opportunities" SET "opp_name" = $1, "updated_at" = $2 WHERE "opportunities"."id" = $3  [["opp_name", "Construction Vol"], ["updated_at", "2021-02-02 21:12:18.569584"], ["id", 1]]

  def destroy
    @opportunity.destroy
---
DELETE FROM "opportunities" WHERE "opportunities"."id" = $1  [["id", 12]]

    def set_opportunity
      @opportunity = Opportunity.find(params[:id])
---
SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def get_organization
      @organization = Organization.find(params[:organization_id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]