app/controllers/opportunities_controller.rb

  def index
    @opportunities = Opportunity.all
---
SELECT "opportunities".* FROM "opportunities"